# MustReplacePanels Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..MustReplacePanels Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Missing Curtain Panels will be replaced with System Panels to complete command.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MustReplacePanels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MustReplacePanels As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MustReplacePanels {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace